// // let js = 'amazing';
// // if (js === 'amazing') alert('JavaScript is FUN!');
// // console.log(10 + 10 + 33 + 88 - 44);

// const country = 'Ukraine';
// const continent = 'Europe';
// let population = 34;
// // let increasePopulation = population++;

// const isIsland = country === 'Ukraine' ? false : true;
// let language = 'candarin';
// const halfPopulation = population / 2;
// const populationOnFinland = 6;
// const checkPopulation = population > populationOnFinland;
// const averagePopulation = 33;
// const checkAvaragePopulation = population > averagePopulation;
// // console.log(increasePopulation);

// switch (language) {
//   case 'candarin':
//   case 'chinese':
//     console.log('number of native speakers!');
//     break;
//   case 'spanish':
//     console.log('2nd place in number of native speakers');
//     break;
//   case 'english':
//     console.log(`3rd place`);
//     break;
//   case 'hindi':
//     console.log('Number 4');
//     break;
//   case 'arabic':
//     console.log('5th most spoken language');
//     break;
//   default:
//     console.log('Great language too :D');
// }

// const textAbovePopulation = `Portugal's population is above average`;
// const textBelowPopulation = `Portugal's population is below average`;

// population > 33
//   ? console.log(textAbovePopulation)
//   : console.log(textBelowPopulation);

// console.log(
//   `Island: ${isIsland}, Population: ${population}, checkAvaragePopulation: ${checkAvaragePopulation}, CheckPopulation: ${checkPopulation}, HalfPopulation: ${halfPopulation}, Country: ${country}, language: ${language}`
// );

// const description = `${country} is in ${continent}, and its ${population} million people speak ${language}`;

// console.log(description);

// if (population > 33) {
//   console.log(`${country} is above average`);
// } else {
//   console.log(`${country} is ${population} million below average`);
// }

// if (population > 50 && !isIsland) {
//   console.log(`Sarah should live in ${country} :)`);
// } else {
//   console.log(`Sarah should not live in ${country} :(`);
// }

// const numNeighbours = +prompt(
//   'How many neighbour countries does your country have?'
// );

// if (numNeighbours === 1) {
//   console.log('Only 1 border!');
// } else if (numNeighbours > 1) {
//   console.log('More than 1 border');
// } else {
//   console.log('No borders');`
// }

// const bmi = mass / (height * height);

// const marksWieght = 78;
// const marksHeight = 1.69;
// const johnsWeight = 92;
// const johnsHeight = 1.95;

// const bmi = (mass, height) => {
//   return (mass / (height * height)).toFixed(0);
// };

// const markBMI = bmi(marksWieght, marksHeight);
// const JohnBMI = bmi(johnsWeight, johnsHeight);

// if (markBMI > JohnBMI) {
//   console.log('Mark has a higher BMI than John');
// } else {
//   console.log('John has a higher BMI than Mark');
// }

// console.log(`res1: ${markBMI} and res2: ${JohnBMI}`);

// const massMark = 78;
// const heightMark = 1.69;
// const massJohn = 92;
// const heightJohn = 1.95;
//
// const BMIMark = massMark / (heightMark * heightMark);
// const BMIJohn = massJohn / (heightJohn * heightJohn);
// console.log(BMIMark, BMIJohn);
//
// if (BMIMark > BMIJohn) {
//   console.log(`Mark's BMI (${BMIMark}) is higher than John's (${BMIJohn})!`);
// } else {
//   console.log(`John's BMI (${BMIJohn}) is higher than Mark's (${BMIMark})!`);
// }
//test1
//test2

const header = {
         agreement: "ТЕРМІНИ ТА ВИЗНАЧЕННЯ ДОГОВОРУ",
        preambula: "ПРЕАМБУЛА",
        objectAgreement: "ПРЕДМЕТ ДОГОВОРУ",
        executorObligationToProvideServices:
    "ВИКОНАВЕЦЬ ЗОБОВ’ЯЗУЄТЬСЯ НАДАВАТИ ПОСЛУГИ КЛІЄНТОВІ, ЩО ВКЛЮЧАЄ",
        rightsAndResponsibilitySides: "ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН",
        changeCondition: "ЗМІНА УМОВ",
        contractTerm: "СТРОК ДІЇ ДОГОВОРУ",
        settlementOfDisputes: "ВИРІШЕННЯ СПОРІВ",
        confidentialInformation: "КОНФІДЕНЦІЙНА ІНФОРМАЦІЯ",
        responsibilitySides: "ВІДПОВІДАЛЬНІСТЬ СТОРІН",
        clientResponsibility: "ВІДПОВІДАЛЬНІСТЬ КЛІЄНТА",
        otherCondition: "ІНШІ УМОВИ",

};

const introduction = [
    "Ви погоджуєтесь, що цей Публічний договір набуває чинності для всіх споживачів з дати публікації та зобов’язані ознайомитись з його умовами.",  "Це Публічний договір між Вами (споживачем), в подальшому – «Клієнт» та ФОП Павлов Максим Валерійович, в подальшому – «Виконавець».", " Використання Системи 220-km.com підтверджує, що Ви прийняли всі умови цього Договору, умови вартості послуг та Правила користування зарядними станціями 220-km.com.",  "ПУБЛІЧНИЙ ДОГОВІР  ПРО НАДАННЯ ПОСЛУГ З ЗАРЯДКИ ЕЛЕКТРОТРАНСПОРТУ  (ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ)",
]

const body =  [
    {
        id: 1,
        title: header.agreement,
        texts: [
            {
                id: 1.1,
                text: "Сайт (сайт 220-km.com, мобільні версії сайту) – сукупність файлів, текстової, графічної та іншої інформації, що розміщена в мережі Інтернет, та прикладне програмне забезпечення, що забезпечує доступ Клієнтів до цієї інформації та дозволяє зараховувати кошті на аккаунт, отримувати дані про отримані Послуги.",
            },
            {
                id: 1.2,
                text: "Послуга – послуга Виконавця із заряджання акумуляторних батарей Електромобіля Клієнта на Зарядних станціях Виконавця, що відбувається автоматично без залучення персоналу Виконавця. Обсяг Послуги вимірюється у Кіловат-годинах. Послуга є технічним обслуговуванням автотранспортних засобів та не є постачанням електроенергії і не потребує ліцензування.",
            },
            {
                id: 1.3,
                text: "Кіловат-година – одиниця вимірювання Послуги. Кіловат-година (надалі – кВт-г) використовується для відображення зміни рівня заряду акумуляторних батарей Електромобілів в результаті надання Послуги. Клієнт – будь-яка особа, що здійснила оплату на сайті 220-km.com і таким чином звернулась до Виконавця за наданням Послуг та набула права та обов‘язки згідно з цім Договором.",
            },
            {
                id: 1.4,
                text: `Система 220-km.com – сукупність програмно-технічних засобів, процедур та правил, використання яких дає змогу Клієнту здійснювати Зарядні сесії, отримувати статистичну інформацію та іншу сервісну (інформаційну) підтримку.`,
            },
            {
                id: 1.5,
                text: "Обробка інформації (даних) - вся сукупність операцій (збирання, введення, записування, перетворення, зчитування, зберігання, знищення, реєстрація), що здійснюються за допомогою технічних і програмних засобів, включаючи обмін по каналах передачі даних.",
            },
            {
                id: 1.6,
                text: "Плата – розмір вартості Послуг, який встановлює Виконавець для Клієнта за отримання Клієнтом Послуг.",
            },
            {
                id: 1.7,
                text: "Платіж – рух певної суми коштів в національній валюті, зокрема за допомогою платіжних карток Visa, Mastercard і Cirrus/Maestro, ініційований Клієнтом з метою отримання Послуг, та які згодом використовуються Клієнтом для оплати Послуг.",
            },
            {
                id: 1.8,
                text: "Зарядна сесія – процес отримання Послуги, в результаті якого відбувається заряджання акумуляторної батареї Електромобіля, що розпочинається після перевірки достатності обсягу передплачених Послуг. Тривалість Зарядної сесії залежить від вартості Послуги, типу зарядного порту, погодних умов, поточного рівня заряду акумуляторної батареї Електромобіля, її технічного стану та інших факторів.",
            },
            {
                id: 1.9,
                text: "Електромобіль – автомобіль, що може використовувати електроенергію як паливо, та обладнаний одною або декількома акумуляторними батареями, який може бути заряджений від зовнішнього джерела електроенергії та використовується для приведення автомобіля у рух.  QR-код – наклейка на Зарядній станції, із скануванням якої за допомогою камери мобільного клієнт може ідентифікувати в Системі  певну Зарядну станцію (в якості одного із способів).",
            },
            {
                id: '1.10',
                text: "Зарядна станція – спеціальне електричне обладнання для отримання Послуг, яке підключено до Системи 220-km.com.",
            },
            {
                id: 1.11,
                text: "Служба підтримки – служба, яка забезпечує інформаційну і технічну підтримку Клієнтів. Служба підтримки здійснює підтримку за допомогою телефону, які зазначені на Сайті.",
            },
        ],
    },
    {
        id: 2,
        title: header.preambula,
        texts: [
            {
                id: 2.1,
                text: `Цей Договір у відповідності до ст.641 Цивільного Кодексу України є офіційною пропозицією (офертою) Виконавця укласти цей Договір і містить істотні умови, необхідні для надання Послуг. 	Згідно з ч.2 ст.642 Цивільного Кодексу України у випадку прийняття нижче вказаних умов, особа цим самим засвідчує своє бажання укласти Договір (акцепт), і з цього моменту вона визначається як Клієнт. Громадянство особи не має значення. `,
            },
            {
                id: 2.2,
                text: "Клієнт вважається таким, що прийняв умови Договору як вони є (“as is”), в повному обсязі, без будь-яких застережень і винятків, з моменту: натиснення віртуальної кнопки «Оплатити» під час активації зарядної сесії. Згодою на отримання Послуг вважаються дії особи, спрямовані на отримання Послуг, в том числі, але не виключено: підключення Електромобіля особи до порту Зарядної станції, фактична зарядка акумуляторних батарей Електромобіля особою на величину 0,001 кВт-г та більше. У разі незгоди Клієнта з будь-якими із положень Договору, Клієнт не має права отримувати Послуги.",
            },
            {
                id: 2.3,
                text: `Даний Договір має юридичну силу відповідно до Закону України «Про електронну комерцію» та ст. 633 ЦК України і є рівносильним Договору, підписаному сторонами.`,
            },
            {
                id: 2.4,
                text: `Даний Договір є публічним і діє два роки або до його припинення будь-якою зі сторін у порядку, встановленому Договором. Якщо Клієнт продовжує користуватись Послугами після закінчення терміну дії Договору, Договір вважається продовженим на такий саме термін.`,
            },
            {
                id: 2.5,
                text: `При незгоді з будь-якими змінами до умов цього Договору, зміною Плати або призначенням нових Платежів в доповнення до вже існуючих, Клієнт повинен припинити отримання Послуг в порядку, визначеному Договором. Якщо Клієнт на наступний день з дати оприлюднення (розміщення) Договору зі змінами на сайті  220-km.com, продовжує користуватись Послугами, Виконавець вправі вважати, що Клієнт згоден із внесеними змінами та доповненнями. Дата оприлюднення (розміщення) Договору зі змінами вказується на початку Договору.`,
            },
        ],
    },
    {
        id: 3,
        title: header.objectAgreement,
        texts: [
            {
                id: 3.1,
                text: "Предметом цього Договору є отримання Послуги зарядки для Електромобілів (далі – Послуги) за допомогою Зарядних станцій Виконавця, які розташовані за адресами (gps коордінатами), вказаними на Сайті 220-km.com.",
            },
            {
                id: 3.2,
                text: "Ціна Послуг вказана на сайті 220-km.com стосовно кожної станції для заряджання. Ціна Послуг не враховує ціну доступу до місць надання Послуг (в т.ч. вартості паркування), яку власник місць надання Послуг встановлює самостійно на свій власний розсуд.",
            },
            {
                id: 3.3,
                text: "Для початку Зарядної сесії Клієнт має оплатити обраний об’єм кіловатт годин.",
            },
            {
                id: 3.4,
                text: "Зарядна сесія клієнта.",
                subTexts: [
                    {
                        id: "3.4.1",
                        subText:
                            "Після того, як Клієнт зробив оплату, може бути розпочата Зарядна сесія.",
                    },
                    {
                        id: "3.4.2",
                        subText:
                            "У разі переривання Зарядної сесії клієнта невикористаний обсяг передплачених Послуг клієнта повертається клієнту.",
                    },
                ],
            },
        ],
    },
    {
        id: 4,
        title: header.executorObligationToProvideServices,
        texts: [
            {
                id: 4.1,
                text: "Надання актуальної інформації щодо статусу станції, ціни Послуг на сайті 220-km.com",
            },
            {
                id: 4.2,
                text: "Послугу зарядки Електромобілів згідно з ціною Послуг, відображеної на сайті 220-km.com",
            },
            {
                id: 4.3,
                text: "Надання Клієнтові необхідної інформації про здійснену оплату за Послуги (за запитом), ведення та зберігання архіву протягом не менш 6 календарних місяців, систематизацію здійснених платежів",
            },
            {
                id: 4.5,
                text: "Функціонування Служби підтримки Клієнтів",
            },
            {
                id: 4.6,
                text: "Інші послуги",
            },
        ],
    },
    {
        id: 5,
        title: header.rightsAndResponsibilitySides,
        texts: [
            {
                id: 5.1,
                text: "Клієнт має право:",
                subTexts: [
                    {
                        id: "5.1.1",
                        subText:
                            "На безоплатне отримання від Виконавця вичерпної актуальної інформації про вартість та порядок надання Послуг на сайті 220-km.com, при цьому послуги зв’язку сплачуються Клієнтом самостійно.",
                    },
                    {
                        id: "5.1.2",
                        subText:
                            "На  якісне отримання передплаченої Послуги, обсяг та якість якої залежить від технічного стану акумулятору електротранспорту та інших факторів, але не більше за величину передплати.",
                    },
                    {
                        id: "5.1.3",
                        subText:
                            "На одностороннє розірвання цього Договору в будь-який момент, у разі відсутності невиконаних зобов’язань Клієнта перед Виконавцем",
                    },
                ],
            },
            {
                id: 5.2,
                text: "Клієнт зобов’язаний:",
                subTexts: [
                    {
                        id: "5.2.1",
                        subText:
                            "Виконувати умови Договору та дотримуватись вимог чинного законодавства України.",
                    },
                    {
                        id: "5.2.2",
                        subText:
                            "Перед початком отримання Послуг уважно ознайомитись з цим Договором, Правилами використання зарядних станцій 220-km.com та вартістю Послуг",
                    },
                    {
                        id: "5.2.3",
                        subText:
                            "При здійсненні Платежів використовувати платіжні засоби, власником яких Клієнт є виключно на законних підставах",
                    },
                    {
                        id: "5.2.4",
                        subText:
                            "Якомога швидше відключитись від Зарядної станції після закінчення Зарядної сесії та звільнити місце для зарядки для наступних Клієнтів",
                    },
                    {
                        id: "5.2.5",
                        subText:
                            "Негайно, але не пізніше 24 годин повідомити Службу підтримки про факт компрометації логіна/пароля",
                    },
                    {
                        id: "5.2.6",
                        subText:
                            "Не використовувати для зарядки на Зарядних станціях Електромобілі та зарядні кабелі, які не відповідають відповідним міжнародним стандартам або є несправними, або несертифіковані, або саморобні, або із модифікаціями системи енергозабезпечення, що не були передбачені відповідним виробником",
                    },
                    {
                        id: "5.2.7",
                        subText: "Не смітити у місцях надання Послуг",
                    },
                    {
                        id: "5.2.8",
                        subText:
                            "Не завдавати шкоди майну, програмному забезпеченню та репутації Виконавця, а також місцю надання Послуг",
                    },
                    {
                        id: "5.2.9",
                        subText:
                            "Відмовитись від отримання Послуг в разі, якщо Клієнт не має права на керування цим Електромобілем та/або заряджання цього Електромобіля",
                    },
                    {
                        id: "5.2.10",
                        subText:
                            "Відмовитись від передачі своїх прав та обов’язків іншим особам, у тому числі надавати можливість отримувати Послуги іншими особами від імені Клієнта.",
                    },
                ],
            },
            {
                id: 5.3,
                text: "Виконавець має право:",
                subTexts: [
                    {
                        id: "5.3.1",
                        subText:
                            "В односторонньому порядку, самостійно, виходячи з ринкових умов та/або особистого розуміння вводити додаткові платні послуги або змінювати плату на існуючі Послуги шляхом оновлення інформації на сайті 220-km.com",
                    },
                    {
                        id: "5.3.2",
                        subText:
                            "В односторонньому порядку змінювати налаштування, дизайн, графічні матеріали, адресу та назву Сайту;",
                    },
                    {
                        id: "5.3.3",
                        subText:
                            "Переривати надання Послуг у випадку проведення профілактичних або ремонтних робіт",
                    },
                    {
                        id: "5.3.4",
                        subText:
                            "На підставі договорів або в інший, не заборонений чинним законодавством України спосіб, залучати третіх осіб з метою більш ефективного надання Послуг",
                    },
                    {
                        id: "5.3.5",
                        subText:
                            "Змінювати розташування Зарядних станцій, збільшувати або зменшувати їх кількість;",
                    },
                    {
                        id: "5.3.6",
                        subText:
                            "На свій розсуд: забезпечувати відеонагляд за Зарядними станціями та зберігати такі дані, страхувати майно або відповідальність перед третіми особами, забезпечувати WiFi-доступ поряд із Зарядними станціями",
                    },
                    {
                        id: "5.3.7",
                        subText:
                            "Вчиняти будь-які дії або сукупність дій, пов'язаних із збиранням, реєстрацією, накопиченням, зберіганням, адаптацією, зміною, поновленням, використанням та поширенням, знеособлюванням, знищенням персональних даних Клієнта (далі – Обробка персональних даних Клієнта) та/або збирати, зберігати, змінювати, використовувати, поширювати (розповсюджувати, реалізовувати, передавати), інформацію, яка стала відома, з метою захисту своїх прав та законних інтересів у судових та інших правоохоронних органах",
                    },
                    {
                        id: "5.3.8",
                        subText:
                            "Використовувати персональні дані Клієнта відповідно до цього пункту. Акцептуванням цього Договору Клієнт, як суб'єкт персональних даних, добровільно надає Виконавцю свою згоду на обробку персональних даних Клієнта, що включає в себе вчинення будь-яких дій та/або сукупності дій, пов'язаних із збиранням, реєстрацією, накопиченням, зберіганням, адаптацією, зміною, поновленням, використанням та поширенням, знеособлюванням, знищенням персональних даних Клієнта, згідно з метою обробки персональних даних, зазначену в цьому пункті Договору та/або з метою пропозиції будь-яких нових послуг і /або встановлення ділових відносин між Клієнтом та Виконавцем на підставі договорів, предмет яких відрізняється від предмета цього Договору. Термін зберігання персональних даних Клієнта становить строк дії цього Договору та додатково 5 років з моменту його розірвання. Обсяг персональних даних Клієнта, щодо яких здійснюється процес обробки персональних даних Клієнта і які можуть бути включені до бази персональних даних, визначається сторонами, як будь-яка інформація про клієнта та/або умови Договору, яка стала відома Виконавцеві при встановленні відносин з Клієнтом. Окрема згода Клієнта на обробку персональних даних Клієнта, наданої останнім згідно з умовами цього пункту, не вимагатиме здійснення повідомлень про передачу персональних даних Клієнта третім особам відповідно до норм ст.21 Закону України «Про захист персональних даних». Акцептуванням цього Договору Клієнт підтверджує, що його повідомили про включення його персональних даних до бази персональних даних, а також, що йому відомі його права, визначені Законом України «Про захист персональних даних».",
                    },
                    {
                        id: "5.3.9",
                        subText:
                            "Зберігати та обробляти дані як на території України, так за кордоном, в тому числі в хмарних сервісах.",
                    },
                ],
            },
            {
                id: 5.4,
                text: "Виконавець зобов’язаний:",
                subTexts: [
                    {
                        id: "5.4.1",
                        subText:
                            "Намагатись цілодобово підтримувати належну працездатність та онлайн-доступ до аккаунту Клієнта, надавати послуги, що передбачені цим Договором;",
                    },
                    {
                        id: "5.4.2",
                        subText:
                            "Своєчасно оновлювати інформацію щодо вартості Послуг, адреси розташування Зарядних станцій, контактної інформації, засобів зв’язку та інших даних Сайту",
                    },
                    {
                        id: "5.4.3",
                        subText: "Забезпечити належну роботу Служби підтримки",
                    },
                    {
                        id: "5.4.4",
                        subText:
                            "Забезпечити конфіденційність даних Клієнтів та дотримання законодавства України про захист персональних даних",
                    },
                ],
            },
        ],
    },
    {
        id: 6,
        title: header.changeCondition,
        texts: [
            {
                id: 6.1,
                text: "Внесення будь-яких змін до умов цього Договору здійснюється односторонньо Виконавцем, шляхом викладення нової редакції Договору, при цьому нові умови надання Послуг вступають в дію з моменту розміщення нової редакції Договору, якщо не зазначене інше.",
            },
        ],
    },
    {
        id: 7,
        title: header.contractTerm,
        texts: [
            {
                id: 7.1,
                text: "Договір є укладеним починаючи з дати Реєстрації або з моменту згоди на отримання Послуги та діє згідно п.2.4 або Виконавець розірве Договір у випадках, зазначених в Договорі. Наслідком розірвання Договору є припинення надання Послуг.",
            },
            {
                id: 7.2,
                text: "У разі тимчасового призупинення користування Послугою за цим Договором з ініціативи Клієнта (без розірвання Договору), Договір вважається чинним.",
            },
        ],
    },
    {
        id: 8,
        title: header.settlementOfDisputes,
        texts: [
            {
                id: 8.1,
                text: "8.1.\tБудь-які спори, що виникають у процесі виконання цього Договору та у зв’язку з ним, в першу чергу обов’язково підлягають вирішенню шляхом переговорів, а при неможливості досягти згоди – у порядку, передбаченому чинним законодавством України.",
            },
        ],
    },
    {
        id: 9,
        title: header.confidentialInformation,
        texts: [
            {
                id: 9.1,
                text: "Сторони визначають як конфіденційну і зобов’язуються не розголошувати наступну інформацію: логін та пароль Зареєстрованого клієнта для доступу до аккаунту Клієнта, персональні та платіжні дані Клієнта.",
            },
            {
                id: 9.2,
                text: "Не вважається розголошенням персональної інформації клієнтів яка відбувається:",
                subTexts: [
                    {
                        id: "9.2.1",
                        subText:
                            "За законними вимогами фіскальних, судових та інших правоохоронних органів",
                    },
                    {
                        id: "9.2.2",
                        subText: "Як результат перейменування юридичної особи Виконавця;",
                    },
                    {
                        id: "9.2.3",
                        subText:
                            "Як результат продажу компанії Виконавця або бізнесу Виконавця з заряджання електромобілів іншим юридичним особам",
                    },
                    {
                        id: "9.2.4",
                        subText:
                            "як результат злиття бізнесу Виконавця з заряджання електромобілів з іншим юридичними особами",
                    },
                    {
                        id: "9.2.5",
                        subText:
                            "як результат зміни учасників (акціонерів) юридичної особи Виконавця",
                    },
                    {
                        id: "9.2.6",
                        subText: "афілійованим особам, які пов’язані з Виконавцем.",
                    },
                ],
            },
            {
                id: 9.3,
                text: "Прийнявши умови цього Договору, Сторони засвідчують розуміння усіх негативних наслідків розголошення зазначеної інформації.",
            },
        ],
    },
    {
        id: 10,
        title: header.responsibilitySides,
        texts: [
            {
                id: 10.1,
                text: "Клієнт починає Зарядну сесію при натисканні на кнопку “Оплатити”.",
            },
            {
                id: 10.2,
                text: "Обсяг Зарядної сесії вимірюється в кВт*г, вартість – в гривні.",
            },
            {
                id: 10.3,
                text: "Клієнт може завершити Зарядну сесію наступним чином:",
                subTexts: [
                    { id: "10.3.1", subText: "Дочекатися завершення сесії" },
                    {
                        id: "10.3.2",
                        subText:
                            "Припинити Зарядну сесію за допомогою вбудованого функціоналу електромобіля",
                    },
                    {
                        id: "10.3.3",
                        subText:
                            "Зателефонувати на номер гарячої лінії (Телефон служби підтримки) Виконавця",
                    },
                ],
                importantText:
                    "Виконавець несе перед Клієнтом відповідальність, пов'язану з наданням Послуг, відповідно до чинного законодавства України та умов цього Договору;",
            },
        ],
    },
    {
        id: 11,
        title: header.clientResponsibility,
        texts: [
            {
                i: 11.1,
                text: "Виконавець несе перед Клієнтом відповідальність, пов'язану з наданням Послуг, відповідно до чинного законодавства України та умов цього Договору",
            },
            {
                id: 11.2,
                text: "Клієнт несе відповідальність за достовірність та відповідність чинному законодавству даних, зазначених при Реєстрації та здійсненні Платежів;",
            },
            {
                id: 11.3,
                text: "Клієнт несе відповідальність за шкоду, заподіяну майну, обладнанню та програмному забезпеченню Виконавця, та місцю надання Послуг, яка сталась внаслідок навмисних або ненавмисних дій Клієнта або заподіяних Клієнтом при використанні Електромобіля, зарядних кабелів або інших технічних або програмних засобів.",
            },
            {
                id: 11.4,
                text: "Виконавець не несе відповідальності за якість каналів зв'язку загального користування та перебої в електромережі, а також мережі передачі даних, за допомогою яких здійснюється доступ до Послуг, за стан і справність, ремонт та обслуговування будь-яких програмно-технічних засобів, що не входять в зону його контролю",
            },
            {
                id: 11.5,
                text: "Виконавець не несе відповідальності за наслідки розголошення логіну та/або паролю Зареєстрованого клієнта",
            },
            {
                id: 11.6,
                text: "Виконавець не несе відповідальності за напругу в електричній мережі і можливі наслідки перепадів напруги в електричній мережі",
            },
            {
                id: 11.7,
                text: "Виконавець не несе відповідальності за напругу в електричній мережі і можливі наслідки перепадів напруги в електричній мережі",
            },
            {
                id: 11.8,
                text: "Виконавець гарантує здатність Зарядних станції видавати струм заявленою потужністю, проте не несе відповідальності за якість та швидкість зарядки у разі особливостей, несправностей або дефектів Електромобіля Клієнта, у тому числі пов’язані зі станом акумуляторної батареї, зарядним портом Електромобіля, відповідним контролером, зарядним кабелем Клієнта і т.ін., та/або у разі нездатності Електромобіля Клієнта приймати струм на потужності, що видається Зарядною станцією, внаслідок роботи внутрішнього контролю системи управління батареї (“Battery Management System”) Електромобіля",
            },
            {
                id: 11.9,
                text: "Виконавець не несе відповідальності за неможливість здійснення Зарядної сесії при відсутності у Клієнта зарядного кабелю;",
            },
            {
                id: 11.11,
                text: "Виконавець не несе відповідальності за негативні наслідки, що виникли внаслідок використання Клієнтом власного зарядного кабелю (за шкоду, причинену здоров’ю Клієнту або третім особам, за пошкодження майна Клієнта чи третіх осіб і т.ін.)",
            },
            {
                id: 11.12,
                text: "Виконавець не несе відповідальності за швидкість процесу заряджання електротранспорту у разі одночасного використання зарядної станції двома Електромобілями, проте Виконавець намагатиметеся забезпечувати максимально можливі параметри зарядного струму на кожному із портів Зарядної станції",
            },
            {
                id: 11.13,
                text: "Виконавець не несе відповідальності за можливість доступу до Зарядної станції у разі перешкоджання під’їзду до неї іншими транспортними засобами або у разі несвоєчасного звільнення зарядного порту іншим Електромобілем або за рішенням власника місць надання Послуг. В той же час Виконавець намагатиметеся забезпечувати якомога вільний доступ до Зарядної станції.",
            },
            {
                id: 11.14,
                text: "Виконавець не несе відповідальності за збереження Електромобіля та/або іншого майна Клієнта ані під час отримання Послуг, ані під час паркування на паркомісці, яке знаходиться поруч або на будь-якій відстані від Зарядної станції.",
            },
            {
                id: 11.15,
                text: "Виконавець не несе відповідальності за будь-які непрямі негативні наслідки з урахуванням положень цього Договору",
            },
            {
                id: 11.16,
                text: "Виконавець не несе відповідальності на неможливість оплатити у разі технічних несправностей на стороні банку, що здійснює еквайринг для Системи 220-km.com.",
            },
        ],
    },
    {
        id: 12,
        title: header.otherCondition,
        texts: [
            {
                id: 12.1,
                text: "лієнт приймає умови цього Договору та засвідчує цілковите розуміння його тексту, в т.ч підстави виникнення, зміст, розмір, строки та умови виконання визначених ним зобов’язань, та відсутність будь-яких заперечень чи зауважень щодо нього.",
            },
            {
                id: 12.2,
                text: "Клієнт приймає умови цього Договору і погоджується передплачувати Послуги у разі прийняття Клієнтом рішення про згоду на отримання Послуг. Згодою на отримання Послуг вважаються дії особи, спрямовані на отримання Послуг, в том числі, але не виключено: підключення Електромобіля особи до порту Зарядної станції, фактична зарядка акумуляторних батарей Електромобіля особою на величину 0,001 кВт-г та більше.",
            },
            {
                id: 12.3,
                text: "Клієнт засвідчує свою згоду:",
                subTexts: [
                    {
                        id: "a",
                        subText:
                            "на обробку та передачу своїх персональних даних з метою належного виконання Послуг;",
                    },
                    {
                        id: "b",
                        subText:
                            "тримання Клієнтом від Виконавця SMS-повідомлень, повідомлень в месенджерах, дзвінків, електронних листів, поштових повідомлень, повідомлень в аккаунті Клієнта, тощо з метою надання Послуг або інформування про інші послуги та можливості, не обов’язково пов’язані із предметом Договору;",
                    },
                    {
                        id: "c",
                        subText:
                            "На запис його голосового повідомлення/заяви тощо у разі звернення до Служби підтримки",
                    },
                    {
                        id: "d",
                        subText:
                            "з тим, що факт сплати Клієнтом будь-якої плати за Договором (у тому числі за зміненими Виконавцем розмірами) є фактом безумовного підтвердження погодження з розміром поточної плати та/або будь-якого іншого платежу.",
                    },
                ],
            },
            {
                id: 12.4,
                text: "Клієнт засвідчує факт його ознайомлення та згоди щодо: переліку, умов та порядку надання Послуг; порядку та системи оплати Послуг, форми розрахунків за їх надання; порядку розгляду звернень Клієнтів; номерів телефонів та інших засобів зв‘язку із Службою підтримки.",
            },
            {
                id: 12.5,
                text: "Згода на отримання Послуг та/або отримання Послуг не тягне виникнення прав Клієнта на бізнес заряджання Виконавця, ані в цілому, ані в будь-який частині, включно із інтелектуальними правами на Сайт, Мобільні додатки, логотип або інші товарні знакі.",
            },
        ],
    },
];

const structureDocument = {
header,introduction, body,
};


console.log(structureDocument)


